// 모든 AR 부착물 수치를 정의
const AR_PARTS_DATA = {
            muzzle: {
                '보정기(AR)': { 
                    v: 15, h: 10, rec: 0, ads: 0, r: 0, ammo: 0, 
                    img: '../img/ar_보정기.webp', 
                    txt: '수직+15%, 수평+10%, 반동 패턴-25%, 탄퍼짐-10%' 
                },
                '제동기(AR)': { 
                    v: 10, h: 8, rec: 0, ads: 0, r: 0, ammo: 0, 
                    img: '../img/ar_제동기.webp', 
                    txt: '수직+10%, 수평+8%, 사격 흔들림 및 총구 들림 제어+35%' 
                },
                '소염기(AR)': { 
                    v: 10, h: 10, rec: 0, ads: 0, r: 0, ammo: 0, 
                    img: '../img/ar_소염기.webp', 
                    txt: '수직+10%, 수평+10%, 총기 반동 패턴-10%, 총구 화염 제거' ,
                    overrides: {
                        'scar-l': {
                            v: 10, h: 10,
                            txt: '수직+10%, 수평+10%, 총구 화염 제거'
                        }
                    }
                },
                '소음기(AR)': { 
                    v: 0, h: 0, rec: 0, ads: 0, r: 0, ammo: 0, 
                    img: '../img/ar_소음기.webp', 
                    txt: '편차-5%, 발사음 대폭 감소, 총구 화염 제거,' 
                }
            },
            grip: {
                '수직 손잡이': { 
                    v: 15, h: 0, rec: 0, ads: 0, r: 0, ammo: 0, 
                    img: '../img/수직손잡이.webp', 
                    txt: '수직+15%' 
                },
                '앵글 손잡이': { 
                    v: 0, h: 15, rec: 0, ads: 10, r: 0, ammo: 0, 
                    img: '../img/앵글손잡이.webp', 
                    txt: '수평+15%, 조준 속도+10%, 호흡 흔들림 제어-10' 
                },
                '하프 그립': { 
                    v: 8, h: 8, rec: 0, ads: 0, r: 0, ammo: 0, 
                    img: '../img/하프그립.webp', 
                    txt: '수직/수평+8%, 단발 사격 반동 회복+10%, 호흡 흔들림 제어-10%' 
                },
                '엄지 그립': { 
                    v: 10, h: 0, rec: 10, ads: 40, r: 0, ammo: 0, 
                    img: '../img/엄지그립.webp', 
                    txt: '수직+10%, 조준속도+40%, 단발 사격 반동 회복+10%, 호흡 흔들림 제어+20%' 
                },
                '라이트 그립': { 
                    v: 0, h: 0, rec: 20, ads: 0, r: 0, ammo: 0, 
                    img: '../img/라이트그립.webp', 
                    txt: '단발 사격 반동 회복+20%, 호흡 흔들림 제어+20%, 총구 들림 제어+10%, 초탄 반동 제어+30%' 
                }
            },
            mag: {
                '대용량 탄창(AR)': { 
                    v: 0, h: 0, rec: 0, ads: 0, r: 0, ammo: 12, 
                    img: '../img/ar_대탄.webp',
                    txt: '장탄수+12' 
                },
                '퀵드로우 탄창(AR)': { 
                    v: 0, h: 0, rec: 0, ads: 0, r: 0.6, ammo: 0, 
                    img: '../img/ar_퀵드.webp', 
                    txt: '장전 시간 60% 단축' 
                },
                '대용량 퀵드로우(AR)': { 
                    v: 0, h: 0, rec: 0, ads: 0, r: 0.15, ammo: 10, 
                    img: '../img/ar_대퀵.webp', 
                    txt: '장탄수+10, 장전 시간 15% 단축' 
                }
            },
            stock: {
                '전술 개머리판': { 
                    v: 0, h: 0, rec: 0, ads: 10, r: 0, ammo: 0, 
                    img: '../img/전술.webp', 
                    txt: '조준속도+10%, 호흡 흔들림 제어+10%, 총구 들림 제어+10%, 초탄 반동 제어+5%' 
                },
                '중량형 개머리판': { 
                    v: 10, h: 10, rec: 5, ads: -10, r: 0, ammo: 0, 
                    img: '../img/중량형.webp', 
                    txt: '수직/수평+10%, 조준속도-10%, 단발 사격 반동 회복+5%, 비조준 사격 정확도-10%' 
                }
            }
        };